exam/app/controllers/difficulties_controller.rb

  def index
    @difficulties = Difficulty.all
---
SELECT * FROM `difficulties`

  def show
    @difficulty = Difficulty.find(params[:id])
---
SELECT * FROM `difficulties` WHERE (`difficulties`.`id` = 0)

  def create
    @difficulty = Difficulty.new(params[:difficulty])

    respond_to do |format|
      if @difficulty.save
---
INSERT INTO `difficulties` (`name`, `updated_at`, `remark`, `point`, `created_at`) VALUES('简单', '2009-09-15 07:18:28', '简单', 1.5, '2009-09-15 07:18:28')