exam/app/controllers/knowledges_controller.rb

SELECT * FROM `knowledges`
---
  def index
    @knowledges = Knowledge.all

SELECT * FROM `knowledges` WHERE (`knowledges`.`id` = 0)
---
  def show
    @knowledge = Knowledge.find(params[:id])

INSERT INTO `knowledges` (`name`, `updated_at`, `remark`, `subject_id`, `created_at`) VALUES('JDBC', '2009-09-15 06:52:17', 'JDBC', 1, '2009-09-15 06:52:17')
---
  def create
    @knowledge = Knowledge.new(params[:knowledge])

    respond_to do |format|
      if @knowledge.save