exam/app/controllers/questions_controller.rb

  def index
    @questions = Question.all
---
SELECT * FROM `questions`

  def select_knowledge
    @knowledges = Knowledge.find(:all, :conditions=>["subject_id = ?", params[:subject]])
---
SELECT * FROM `knowledges` WHERE (subject_id = '1')

  def add_knowledge
    session[:selected_knowledge] ||= []
    @selected_knowledge = session[:selected_knowledge]
    @selected_knowledge << Knowledge.find(params[:id]) if params[:id]
---
SELECT * FROM `knowledges` WHERE (`knowledges`.`id` = 1)

  def show
    @question = Question.find(params[:id])
---
SELECT * FROM `questions` WHERE (`questions`.`id` = 0)

  def edit
    @question = Question.find(params[:id])
---
SELECT * FROM `questions` WHERE (`questions`.`id` = 1)

  def create
    @question = Question.new(params[:question])

    respond_to do |format|
      if @question.save
---
INSERT INTO `questions` (`answer`, `updated_at`, `difficulty_id`, `remark`, `content`, `knowledges_id`, `created_at`) VALUES('1', '2009-09-18 02:11:29', 2, '1', '1', '1,6', '2009-09-18 02:11:29')